["Coast Redwood (Sequoia sempervirens) - in the fog-shrouded coast ranges.", "Giant Sequoia (Sequoiadendron giganteum) - in the Sierra Nevada Mountains.", "Bishop Pine (Pinus muricata) - coastal species - gardens.", "Coulter Pine (Pinus coulteri)", "Grey Pine - Digger Pine (Pinus sabiniana)", "Knobcone Pine (Pinus attenuata)", "Ponderosa Pine (Pinus ponderosa) - well known in mountains", "Monterey Pine (Pinus radiata) - naturally limited endemic - widely planted horticulturally around the world.", "Limber Pine (Pinus flexilis)", "Jeffrey Pine (Pinus jeffreyi)", "Parry Pinyon (Pinus quadrifolia)", "Shore Pine (Pinus contorta)", "Sugar Pine (Pinus lambertiana)", "Torrey Pine (Pinus torreyana)", "Western White Pine (Pinus monticola)", "Single-leaf Pinyon Pine (Pinus monophylla)", "Great Basin Bristlecone Pine (Pinus longaeva) - the 'Methuselah' - 4,700 years old.", "Foxtail Pine (Pinus balfouriana) - Californian endemic; 2,000 year old specimens.", "Santa Lucia Fir (Abies bracteata) and seven other native Abies species.", "Douglas-Fir (Pseudotsuga menziesii)", "Bigcone Douglas-Fir (Pseudotsuga macrocarpa) - Central Coast and Santa Susana Mountains.", "California Nutmeg (Torreya californica)", "Incense Cedar (Calocedrus decurrens)", "Port Orford Cedar-Lawson Cypress (Chamaecyparis lawsoniana)", "White Fir (Abies concolor) - at high elevations", "Mountain Hemlock (Tsuga mertensiana)", "Red Fir (Abies magnifica)", "Tanoak (Lithocarpus densiflorus)", "California Bay Laurel (Umbellularia californica)", "Madrone (Arbutus menziesii)", "Toyon (Heteromeles arbutifolia)", "Bigleaf Maple (Acer macrophyllum)", "Western Blue Elderberry (Sambucus mexicana) is found throughout the state, an important host for birds, butterflies, pollinators, and beneficial insects (Integrated pest management (IPM)).", "California Buckeye (Aesculus californica)", "Western Redbud (Cercis occidentalis)", "California Black Walnut (Juglans californica)", "California Hazelnut (Corylus cornuta)", "California Poppy (Eschscholzia californica) are found in drier places. California poppies are also an annual in many places.", "Douglas Iris (Iris douglasiana) and 'Pacific Coast' hybrids", "Monkeyflower e.g.: Mimulus aurantiacus, Mimulus guttatus, Mimulus cardinalis and cultivars.", "Columbine (Aquilegia spp.)", "Coyote Mint (Monardella spp.)", "Buckwheats (Eriogonum fasciculatum), (Eriogonum giganteum), (Eriogonum umbellatum)", "Western wild ginger (Asarum caudatum)", "Pacific bleeding-heart (Dicentra formosa)", "Island Coral Bells (Heuchera maxima)", "Canyon Coral Bells (Heuchera hirsutissima)", "Hairy Purple Bells (Heuchera villosa)", "Heucherella", "Threeleaf Foamflower (Tiarella trifoliata)", "Redwood sorrel (Oxalis oregana)[12]", "Polypody Ferns (Polypodium), e.g.: Polypodium californicum", "Native Sword Ferns (Polystichum), e.g.: Polystichum munitum", "Giant Chain Fern (Woodwardia fimbriata)", "Goldback Ferns (Pteridium spp.)", "Wood Ferns (Dryopteris spp.), e.g.: Dryopteris arguta", "Maidenhair Ferns (Adiantum spp.) e.g.: Adiantum jordanii", "Baby Blue Eyes (Nemophila menziesii)", "Blazing Star (Mentzelia lindleyi)", "California Poppy (Eschscholzia californica)", "Chinese Houses (Collinsia heterophylla)", "Elegant Clarkia (Clarkia unguiculata)", "Farewell-to-spring (Clarkia amoena)", "Meadowfoam (Limnanthes douglasii)", "Miner's Lettuce (Claytonia perfoliata)", "Tarweed (Madia elegans)", "Wind Poppy (Stylomecon heterophylla)[13]", "A California Flora and Supplement, Philip A. Munz and David D. Keck, UC Press", "Grasses in California, Beecher Crampton, UC Press", "The Jepson Manual: Higher Plants of California, James C. Hickman (Editor), UC Press", "The Jepson Desert Manual: Vascular Plants of Southeastern California, Bruce Baldwin (Editor), UC Press", "Oaks of California, Bruce M. Pavlik, Pamela Muick, Sharon Johnson, Cachuma Press", "Plants of the San Francisco Bay Region: Mendocino to Monterey, Linda Beidleman, Eugene Kozloff, UC Press", "Landscape Plants for California Gardens, Bob Perry, Land Design Publishing", "California Native Plants for the Garden, Carol Bornstein, David Fross, and Bart O'Brien, Cachuma Press", "California Native Trees and Shrubs, Lee W. Lenz, Rancho Santa Ana", "Ceanothus, David Fross and Dieter Wilken, Timber Press", "Complete Guide to Native Perennials of California, Glenn Keator, Chronicle Books", "Complete Guide to Native Shrubs of California, Glenn Keator, Chronicle Books", "Designing California Native Gardens: The Plant Community Approach to Artful, Ecological Gardens, Glenn Keator and Alrie Middlebrook, UC Press", "Growing California Native Plants, Marjorie Schmidt, UC Press", "Native Landscaping From El Paso to L.A., Sally Wasowski and Andy Wasowski, McGraw-Hill", "Native Plants for California Gardens, Lee W. Lenz, Day Printing Corp.", "Native Treasures: Gardening with the Plants of California, M. Nevin Smith, UC Press", "CNPS—California Native Plant Society website", "CalFlora Database — extensive searchable database of California native plants.", "Jepson Manual 'Flora Interchange' — extensive database of California native plants", "U.C. CalPhotos: Flora homepage — searchable images database", "Theodore Payne Foundation for Wildflowers and Native Plants — including horticultural information", "California Native Grasslands Association — including bunchgrass species & habitats"]
